<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest Osculator package</string>
    <key>Identifier</key>
    <string>com.github.nzmacgeek.osculator.download</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Osculator</string>
    </dict>
    <key>Process</key>
    <array>
    <dict>
      <key>Processor</key>
      <string>URLTextSearcher</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>http://www.osculator.net/downloadthanks.php?stable=</string>
        <key>re_pattern</key>
        <string>'(http://dl.osculator.net/releases/osculator-.*.dmg)'</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>%match%</string>
      </dict>
    </dict>
  </array>
  </dict>
</plist>
