<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest FileMaker Pro full installer disk image and extracts the package from within.</string>
    <key>Identifier</key>
    <string>com.github.nzmacgeek.download.filemaker</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileMaker Pro</string>
        <key>major_version</key>
        <string>16</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FilemakerUpdateURLProcessor</string>
            <key>Arguments</key>
            <dict>
                <key>major_version</key>
                <string>%major_version%</string>
		<key>do_full_installer</key>
		<integer>1</integer>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
          <key>Processor</key>
          <string>FilemakerUpdateExtractor</string>
          <key>Arguments</key>
          <dict>
            <key>downloaded_file</key>
            <string>%pathname%</string>
          </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pkg_path%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/FileMakerPro_%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
