<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads latest GoPro Quik package</string>
    <key>Identifier</key>
    <string>com.github.nzmacgeek.quik.download</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Quik</string>
    </dict>
    <key>Process</key>
    <array>
    <dict>
      <key>Processor</key>
      <string>URLDownloader</string>
      <key>Arguments</key>
      <dict>
        <key>url</key>
        <string>https://gopro.com/downloads/Mac/Quik/latest</string>
	<key>filename</key>
	<string>quik.dmg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgCopier</string>
      <key>Arguments</key>
      <dict>
        <key>source_pkg</key>
        <string>%pathname%/Quik.pkg</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>FlatPkgUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>destination_path</key>
	<string>%RECIPE_CACHE_DIR%/%NAME%/</string>
	<key>flat_pkg_path</key>
	<string>%pkg_path%</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>PkgPayloadUnpacker</string>
      <key>Arguments</key>
      <dict>
        <key>pkg_payload_path</key>
	<string>%RECIPE_CACHE_DIR%/%NAME%/Quik.pkg/Payload</string>
	<key>destination_path</key>
	<string>%RECIPE_CACHE_DIR%/%NAME%-unpacked/</string>
      </dict>
    </dict>
    <dict>
	<key>Processor</key>
	<string>PlistReader</string>
	<key>Arguments</key>
	<dict>
	  <key>info_path</key>
	  <string>%RECIPE_CACHE_DIR%/%NAME%-unpacked/Applications/Quik.app/Contents/Info.plist</string>
	</dict>
    </dict>
    <dict>
      <key>Processor</key>
	<string>PkgCopier</string>
      <key>Arguments</key>
         <dict>
		<key>source_pkg</key>
		<string>%pkg_path%</string>
		<key>pkg_path</key>
		<string>%RECIPE_CACHE_DIR%/Quik-%version%.pkg</string>
         </dict>
     </dict>
	<dict>
		<key>Processor</key>
		<string>PathDeleter</string>
		<key>Arguments</key>
		<dict>
		<key>path_list</key>
		<array>
			<string>%RECIPE_CACHE_DIR%/%NAME%-unpacked</string>
			<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			<string>%RECIPE_CACHE_DIR%/Quik.pkg</string>
		</array>
		</dict>
	</dict>
  </array>
  </dict>
</plist>
